run/marangoni/0_orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            inletOutlet;
        value           uniform 0;
        inletValue      uniform 0;
    }

    right
    {
        type           zeroGradient;
    }
    
    left
    {
        type           zeroGradient;
    }

    bottom
    {
        type           zeroGradient;
    }

    frontAndBack
    {
        type           empty;
    }
}


// ************************************************************************* //
